import os
import pickle

#Список міст,пропозицій
CITIES = [
    'Варшава',
    'Ґданськ',
    'Краків',
    'Лодзь',
    'Вроцлав',
    'Познань',
    'Гданськ',
    'Щецин',
    'Бидгощ',
    'Люблін',
    'Катовиці',
    "Білосток",
    "Гдиня"	,
    "Ченстохова",
    "Радом",
    "Сосновець",	
    "Торунь",
    "Кельці",
    "Гливиці",	
    "Забже",
    "Битом",
    "Ольштин",	
    "Бєльско-Бяла",
    "Бєльско Бяла",
    "Ряшів",	
    "Руда", 
    "Рибник",	
    "Тихи",	
    "Домброва", 
    "Плоцьк",	
    "Ополе",	
    "Ельблонг",	
    "Гожув-Великопольський",	
    "Гожув Великопольський",	
    "Валбжих",	
    "Влоцлавек",	
    "Зелена Гура",	
    "Тарнів",	
    "Хожув",	
    "Каліш",	
    "Кошалін",	
    "Легниця", 
    "Грудзьондз",	 
    "Слупськ",	 
    "Явожно",	 
    "Ястшембе-Здруй",
    "Ястшембе Здруй",
    "Єленя Гура",	 
    "Новий Сонч",	 
    "Конін",	 
    "Пйотркув-Трибунальський",
    "Пйотркув Трибунальський",	 
    "Седльце",	 
    "Іновроцлав",	 
    "Любін",	 
    "Мисловиці",	 
    "Піла",	
    "Островець-Свентокшиський",	 
    "Островець Свентокшиський",
    "Острув-Великопольський",	 
    "Острув Великопольський",
    "Семяновіце-Шльонські",	
    "Семяновіце Шльонські", 
    "Старгард",	 
    "Паб\'яниці",
    "Пабяниці",
    "Паб`яниці",	 
    "Гнєзно", 
    "Глогув",	 
    "Сувалки",	 
    "Холм",	 
    "Перемишль",	 
    "Замостя",	 
    "Томашув-Мазовецький",
    "Томашув Мазовецький",	
    "Стальова Воля",	 
    "Кендзежин-Козле",
    "Кендзежин Козле",
    "Лешно",	 
    "Ломжа",	 
    "Жори",	 
    "Белхатів",	 
    "Мелець",	 
    "Тарновські Гури",	 
    "Тчев",	
    "Свідниця",	
    "Пекари-Шльонські",	
    "Пекари Шльонські",
    "Згеж",	
    "Біла Підляська",	
    "Рацибуж"	
    "Елк",	
    "Прушкув",	
    "Свентохловіце",	
    "Остроленка",	
    "Стараховиці"	
    "Заверце",	
    "Легіоново",	
    "Тарнобжег",	
    "Пулави",	
    "Водзіслав-Шльонський",
    "Водзіслав Шльонський",	
    "Радомсько",	
    "Скерневиці",	
    "Скаржиско-Каменна",	
    "Старогард-Гданський",
    "Старогард Гданський",	
    "Коросно",	
    "Кутно",	
    "Ниса",	
    "Дембіца",	
    "Вейхерово",	
    "Цеханув",	
    "Колобжег" 
]

# Дістаємо повідомлення із списку міст,по дефолту діапазон від 0 до 10
def get_cities_list(limit = 10) -> list:
    return CITIES[0:limit]

file = 'cities.pickle'
def set_selected_city(data: dict):
    with open(file, 'wb') as f:
        pickle.dump(data, f)

def get_selected_city(id: str):
    if os.path.getsize(file) > 0:
        with open(file, 'rb') as f:
            data = pickle.load(f)
        
        with open(file, 'wb') as f:
            pickle.dump({},f)
        
        # Якщо користувача з вибраним містом немає у файлі, то повртаємо None
        if id in data:
            return data[id]
        return None
   


