#Список вакансій,пропозицій

OFFERS = [
    "На высокий склад требуется водитель погрузчика, с правами на боковой погрузчик."
    "Требуется карщик на склад обуви, с правами UDT. Оплата 20 зл в час, жильё возлеклада, бесплатно",
    "Карщик на склад автозапчасти. Минимальный опыт работы, от 1 года",
    "Ищем кладовщика с правами на боковой погрузчик. Ставка 20 зл, есть возможность работать по 12 часов",
    "Водитель погрузчика, с правами на склад текстиля. Нужно UDT, возьмём без опыта",
    "На производство продукции, нужен карщик с правами и опытом",
]

